{
  "format": "graph-model",
  "generatedBy": "2.15.0",
  "convertedBy": "TensorFlow.js Converter v4.14.0",
  "signature": {
    "inputs": {
      "input_12": {
        "name": "input_12:0",
        "dtype": "DT_FLOAT",
        "tensorShape": { "dim": [{ "size": "-1" }, { "size": "64" }] }
      }
    },
    "outputs": {
      "conv2d_transpose_17": {
        "name": "Identity:0",
        "dtype": "DT_FLOAT",
        "tensorShape": {
          "dim": [
            { "size": "-1" },
            { "size": "64" },
            { "size": "64" },
            { "size": "1" }
          ]
        }
      }
    }
  },
  "modelTopology": {
    "node": [
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/2",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/3",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/conv2d_transpose/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "1" },
                  { "size": "32" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/2",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/3",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/conv2d_transpose/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "32" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/2",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/3",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/conv2d_transpose/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": {
                "dim": [
                  { "size": "3" },
                  { "size": "3" },
                  { "size": "64" },
                  { "size": "64" }
                ]
              }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/dense_11/MatMul/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }, { "size": "4096" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/dense_11/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "4096" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack_1",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack_2",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_INT32",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/1",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/2",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/3",
        "op": "Const",
        "attr": {
          "value": { "tensor": { "dtype": "DT_INT32", "tensorShape": {} } },
          "dtype": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "64" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "32" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/BiasAdd/ReadVariableOp",
        "op": "Const",
        "attr": {
          "value": {
            "tensor": {
              "dtype": "DT_FLOAT",
              "tensorShape": { "dim": [{ "size": "1" }] }
            }
          },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "input_12",
        "op": "Placeholder",
        "attr": {
          "shape": { "shape": { "dim": [{ "size": "-1" }, { "size": "64" }] } },
          "dtype": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/dense_11/Relu",
        "op": "_FusedMatMul",
        "input": [
          "input_12",
          "StatefulPartitionedCall/decoder/dense_11/MatMul/ReadVariableOp",
          "StatefulPartitionedCall/decoder/dense_11/BiasAdd/ReadVariableOp"
        ],
        "device": "/device:CPU:0",
        "attr": {
          "transpose_a": { "b": false },
          "transpose_b": { "b": false },
          "fused_ops": { "list": { "s": ["Qmlhc0FkZA==", "UmVsdQ=="] } },
          "num_args": { "i": "1" },
          "leakyrelu_alpha": { "f": 0.2 },
          "epsilon": { "f": 0.0 },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/Shape",
        "op": "Shape",
        "input": ["StatefulPartitionedCall/decoder/dense_11/Relu"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/strided_slice",
        "op": "StridedSlice",
        "input": [
          "StatefulPartitionedCall/decoder/reshape_5/Shape",
          "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack",
          "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack_1",
          "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack_2"
        ],
        "attr": {
          "shrink_axis_mask": { "i": "1" },
          "new_axis_mask": { "i": "0" },
          "Index": { "type": "DT_INT32" },
          "begin_mask": { "i": "0" },
          "end_mask": { "i": "0" },
          "T": { "type": "DT_INT32" },
          "ellipsis_mask": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/decoder/reshape_5/strided_slice",
          "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/1",
          "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/2",
          "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/3"
        ],
        "attr": {
          "N": { "i": "4" },
          "axis": { "i": "0" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape",
        "op": "Reshape",
        "input": [
          "StatefulPartitionedCall/decoder/dense_11/Relu",
          "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape"
        ],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "Tshape": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/Shape",
        "op": "Shape",
        "input": ["StatefulPartitionedCall/decoder/reshape_5/Reshape"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice",
        "op": "StridedSlice",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/Shape",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack_1",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack_2"
        ],
        "attr": {
          "shrink_axis_mask": { "i": "1" },
          "new_axis_mask": { "i": "0" },
          "Index": { "type": "DT_INT32" },
          "begin_mask": { "i": "0" },
          "T": { "type": "DT_INT32" },
          "end_mask": { "i": "0" },
          "ellipsis_mask": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/1",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/2",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/3"
        ],
        "attr": {
          "N": { "i": "4" },
          "axis": { "i": "0" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/conv2d_transpose",
        "op": "Conv2DBackpropInput",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/conv2d_transpose/ReadVariableOp",
          "StatefulPartitionedCall/decoder/reshape_5/Reshape"
        ],
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/conv2d_transpose",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/BiasAdd/ReadVariableOp"
        ],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/BiasAdd"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/Shape",
        "op": "Shape",
        "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_15/Relu"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice",
        "op": "StridedSlice",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/Shape",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack_1",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack_2"
        ],
        "attr": {
          "shrink_axis_mask": { "i": "1" },
          "new_axis_mask": { "i": "0" },
          "Index": { "type": "DT_INT32" },
          "begin_mask": { "i": "0" },
          "end_mask": { "i": "0" },
          "T": { "type": "DT_INT32" },
          "ellipsis_mask": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/1",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/2",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/3"
        ],
        "attr": {
          "N": { "i": "4" },
          "axis": { "i": "0" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/conv2d_transpose",
        "op": "Conv2DBackpropInput",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/conv2d_transpose/ReadVariableOp",
          "StatefulPartitionedCall/decoder/conv2d_transpose_15/Relu"
        ],
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/conv2d_transpose",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/BiasAdd/ReadVariableOp"
        ],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/Relu",
        "op": "Relu",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/BiasAdd"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/Shape",
        "op": "Shape",
        "input": ["StatefulPartitionedCall/decoder/conv2d_transpose_16/Relu"],
        "attr": {
          "T": { "type": "DT_FLOAT" },
          "out_type": { "type": "DT_INT32" }
        },
        "experimentalType": {
          "typeId": "TFT_PRODUCT",
          "args": [
            {
              "typeId": "TFT_SHAPE_TENSOR",
              "args": [{ "typeId": "TFT_INT32" }]
            }
          ]
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice",
        "op": "StridedSlice",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/Shape",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack_1",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack_2"
        ],
        "attr": {
          "shrink_axis_mask": { "i": "1" },
          "new_axis_mask": { "i": "0" },
          "Index": { "type": "DT_INT32" },
          "begin_mask": { "i": "0" },
          "T": { "type": "DT_INT32" },
          "end_mask": { "i": "0" },
          "ellipsis_mask": { "i": "0" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack",
        "op": "Pack",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/1",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/2",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/3"
        ],
        "attr": {
          "N": { "i": "4" },
          "axis": { "i": "0" },
          "T": { "type": "DT_INT32" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/conv2d_transpose",
        "op": "Conv2DBackpropInput",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/conv2d_transpose/ReadVariableOp",
          "StatefulPartitionedCall/decoder/conv2d_transpose_16/Relu"
        ],
        "attr": {
          "padding": { "s": "U0FNRQ==" },
          "data_format": { "s": "TkhXQw==" },
          "use_cudnn_on_gpu": { "b": true },
          "strides": { "list": { "i": ["1", "2", "2", "1"] } },
          "T": { "type": "DT_FLOAT" },
          "explicit_paddings": { "list": {} },
          "dilations": { "list": { "i": ["1", "1", "1", "1"] } }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/BiasAdd",
        "op": "BiasAdd",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/conv2d_transpose",
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/BiasAdd/ReadVariableOp"
        ],
        "attr": {
          "data_format": { "s": "TkhXQw==" },
          "T": { "type": "DT_FLOAT" }
        }
      },
      {
        "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/Sigmoid",
        "op": "Sigmoid",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/BiasAdd"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      },
      {
        "name": "Identity",
        "op": "Identity",
        "input": [
          "StatefulPartitionedCall/decoder/conv2d_transpose_17/Sigmoid"
        ],
        "attr": { "T": { "type": "DT_FLOAT" } }
      }
    ],
    "library": {},
    "versions": { "producer": 1645 }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack_1",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/strided_slice/stack_2",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/1",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/2",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/stack/3",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/conv2d_transpose/ReadVariableOp",
          "shape": [3, 3, 1, 32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack_1",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/strided_slice/stack_2",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/1",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/2",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/stack/3",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/conv2d_transpose/ReadVariableOp",
          "shape": [3, 3, 32, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack_1",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/strided_slice/stack_2",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/1",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/2",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/stack/3",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/conv2d_transpose/ReadVariableOp",
          "shape": [3, 3, 64, 64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/dense_11/MatMul/ReadVariableOp",
          "shape": [64, 4096],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/dense_11/BiasAdd/ReadVariableOp",
          "shape": [4096],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack_1",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/reshape_5/strided_slice/stack_2",
          "shape": [1],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/1",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/2",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/reshape_5/Reshape/shape/3",
          "shape": [],
          "dtype": "int32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_15/BiasAdd/ReadVariableOp",
          "shape": [64],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_16/BiasAdd/ReadVariableOp",
          "shape": [32],
          "dtype": "float32"
        },
        {
          "name": "StatefulPartitionedCall/decoder/conv2d_transpose_17/BiasAdd/ReadVariableOp",
          "shape": [1],
          "dtype": "float32"
        }
      ]
    }
  ]
}
